brain/Freud.tex
% Created 2017-09-12 Tue 09:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.10)}, 
 pdflang={English}}
\begin{document}


\section*{Sigmund Freud}
\label{sec:orgcce932a}
Father of Psychoanalysis

\subsection*{The Psyche}
\label{sec:orgd6fb9e7}
Human mind divided into 3 areas:

\subsubsection*{Id}
\label{sec:org97abaaa}
\begin{itemize}
\item Unconscious
\item Irrational
\item Based on raw, primal instinct
\item Libido or ``drive'' for food, water and sex
\item Does not think -- it acts
\item Innate -- no experience -- does not learn
\item \textbf{the pleasure principle} -- needs to be regulated
\item Evolution
\end{itemize}

\subsubsection*{Superego}
\label{sec:orgde7784b}
\begin{itemize}
\item Subconscious or preconscious
\item Moral / Judicial branch of personality
\item Ethics, values, and rules
\item Shaped by parents, society, culture, religion
\item Idealism -- not reality
\item Socialization and Cultural Tradition

Ego Ideal represents all that is morally good -- ``Smile''

Conscience represents all that is morally bad -- ``Don't frown''
\end{itemize}

\subsubsection*{Ego}
\label{sec:org64002c5}
\begin{itemize}
\item Conscious -- it is your personality
\item Regulates \emph{id} and \emph{superego}
\item Seeks balance between the \emph{id} and the real world
\item Perception, memory, thinking
\item Common sense acquired through experience
\item \textbf{The reality principle}
\item Interaction with Reality / Learning
\end{itemize}

\subsubsection*{Literary Applications}
\label{sec:orgc77c244}
Authors create characters who are of ``two minds''

\begin{itemize}
\item The character \uline{\textbf{knows}} what is right but is compelled to do wrong
\item In cartoons, we see the angel and devil on opposite shoulders
\end{itemize}

\begin{itemize}
\item Examples
\label{sec:org99107b6}
\begin{itemize}
\item Macbeth's decision to murder King Duncan in \emph{Macbeth}
\item Peter Griffin's decision to play golf or celebrate his anniversary
\item Raskolnikov's split personality or dual nature in \emph{Crime and Punishment}
\end{itemize}
\begin{itemize}
\item Authors also create characters who represent \uline{\textbf{parts}} of the psyche
\end{itemize}

Lord of the Flies

\begin{itemize}
\item Jack
\begin{itemize}
\item Irrational, primal, libido, action / not words
\end{itemize}
\item Piggy
\begin{itemize}
\item Rational, moral, ethical, historical, rule-driven
\end{itemize}
\item Ralph
\begin{itemize}
\item Balanced, democratic, realistic, experienced
\end{itemize}
\end{itemize}
\end{itemize}


\subsection*{Psycho-sexual Stages}
\label{sec:org4723c6d}

\subsection*{}
\label{sec:orgc31bb35}
\end{document}
